GopalSaraf/Practicals/PSDL/include/proc/pic18lf46j11.inc
// Register: PORTD
#define PORTD PORTD
PORTD                                    equ 0F83h
// bitfield definitions
PORTD_RD0_POSN                           equ 0000h
PORTD_RD0_POSITION                       equ 0000h
PORTD_RD0_SIZE                           equ 0001h
PORTD_RD0_LENGTH                         equ 0001h
PORTD_RD0_MASK                           equ 0001h
PORTD_RD1_POSN                           equ 0001h
PORTD_RD1_POSITION                       equ 0001h
PORTD_RD1_SIZE                           equ 0001h
PORTD_RD1_LENGTH                         equ 0001h
PORTD_RD1_MASK                           equ 0002h
PORTD_RD2_POSN                           equ 0002h
PORTD_RD2_POSITION                       equ 0002h
PORTD_RD2_SIZE                           equ 0001h
PORTD_RD2_LENGTH                         equ 0001h
PORTD_RD2_MASK                           equ 0004h
PORTD_RD3_POSN                           equ 0003h
PORTD_RD3_POSITION                       equ 0003h
PORTD_RD3_SIZE                           equ 0001h
PORTD_RD3_LENGTH                         equ 0001h
PORTD_RD3_MASK                           equ 0008h
PORTD_RD4_POSN                           equ 0004h
PORTD_RD4_POSITION                       equ 0004h
PORTD_RD4_SIZE                           equ 0001h
PORTD_RD4_LENGTH                         equ 0001h
PORTD_RD4_MASK                           equ 0010h
PORTD_RD5_POSN                           equ 0005h
PORTD_RD5_POSITION                       equ 0005h
PORTD_RD5_SIZE                           equ 0001h
PORTD_RD5_LENGTH                         equ 0001h
PORTD_RD5_MASK                           equ 0020h
PORTD_RD6_POSN                           equ 0006h
PORTD_RD6_POSITION                       equ 0006h
PORTD_RD6_SIZE                           equ 0001h
PORTD_RD6_LENGTH                         equ 0001h
PORTD_RD6_MASK                           equ 0040h
PORTD_RD7_POSN                           equ 0007h
PORTD_RD7_POSITION                       equ 0007h
PORTD_RD7_SIZE                           equ 0001h
PORTD_RD7_LENGTH                         equ 0001h
PORTD_RD7_MASK                           equ 0080h
PORTD_PMD0_POSN                          equ 0000h
PORTD_PMD0_POSITION                      equ 0000h
PORTD_PMD0_SIZE                          equ 0001h
PORTD_PMD0_LENGTH                        equ 0001h
PORTD_PMD0_MASK                          equ 0001h
PORTD_PMD1_POSN                          equ 0001h
PORTD_PMD1_POSITION                      equ 0001h
PORTD_PMD1_SIZE                          equ 0001h
PORTD_PMD1_LENGTH                        equ 0001h
PORTD_PMD1_MASK                          equ 0002h
PORTD_PMD2_POSN                          equ 0002h
PORTD_PMD2_POSITION                      equ 0002h
PORTD_PMD2_SIZE                          equ 0001h
PORTD_PMD2_LENGTH                        equ 0001h
PORTD_PMD2_MASK                          equ 0004h
PORTD_PMD3_POSN                          equ 0003h
PORTD_PMD3_POSITION                      equ 0003h
PORTD_PMD3_SIZE                          equ 0001h
PORTD_PMD3_LENGTH                        equ 0001h
PORTD_PMD3_MASK                          equ 0008h
PORTD_PMD4_POSN                          equ 0004h
PORTD_PMD4_POSITION                      equ 0004h
PORTD_PMD4_SIZE                          equ 0001h
PORTD_PMD4_LENGTH                        equ 0001h
PORTD_PMD4_MASK                          equ 0010h
PORTD_PMD5_POSN                          equ 0005h
PORTD_PMD5_POSITION                      equ 0005h
PORTD_PMD5_SIZE                          equ 0001h
PORTD_PMD5_LENGTH                        equ 0001h
PORTD_PMD5_MASK                          equ 0020h
PORTD_PMD6_POSN                          equ 0006h
PORTD_PMD6_POSITION                      equ 0006h
PORTD_PMD6_SIZE                          equ 0001h
PORTD_PMD6_LENGTH                        equ 0001h
PORTD_PMD6_MASK                          equ 0040h
PORTD_PMD7_POSN                          equ 0007h
PORTD_PMD7_POSITION                      equ 0007h
PORTD_PMD7_SIZE                          equ 0001h
PORTD_PMD7_LENGTH                        equ 0001h
PORTD_PMD7_MASK                          equ 0080h
PORTD_SCL2_POSN                          equ 0000h
PORTD_SCL2_POSITION                      equ 0000h
PORTD_SCL2_SIZE                          equ 0001h
PORTD_SCL2_LENGTH                        equ 0001h
PORTD_SCL2_MASK                          equ 0001h
PORTD_SDA2_POSN                          equ 0001h
PORTD_SDA2_POSITION                      equ 0001h
PORTD_SDA2_SIZE                          equ 0001h
PORTD_SDA2_LENGTH                        equ 0001h
PORTD_SDA2_MASK                          equ 0002h
PORTD_RP19_POSN                          equ 0002h
PORTD_RP19_POSITION                      equ 0002h
PORTD_RP19_SIZE                          equ 0001h
PORTD_RP19_LENGTH                        equ 0001h
PORTD_RP19_MASK                          equ 0004h
PORTD_RP20_POSN                          equ 0003h
PORTD_RP20_POSITION                      equ 0003h
PORTD_RP20_SIZE                          equ 0001h
PORTD_RP20_LENGTH                        equ 0001h
PORTD_RP20_MASK                          equ 0008h
PORTD_RP21_POSN                          equ 0004h
PORTD_RP21_POSITION                      equ 0004h
PORTD_RP21_SIZE                          equ 0001h
PORTD_RP21_LENGTH                        equ 0001h
PORTD_RP21_MASK                          equ 0010h
PORTD_RP22_POSN                          equ 0005h
PORTD_RP22_POSITION                      equ 0005h
PORTD_RP22_SIZE                          equ 0001h
PORTD_RP22_LENGTH                        equ 0001h
PORTD_RP22_MASK                          equ 0020h
PORTD_RP23_POSN                          equ 0006h
PORTD_RP23_POSITION                      equ 0006h
PORTD_RP23_SIZE                          equ 0001h
PORTD_RP23_LENGTH                        equ 0001h
PORTD_RP23_MASK                          equ 0040h
PORTD_RP24_POSN                          equ 0007h
PORTD_RP24_POSITION                      equ 0007h
PORTD_RP24_SIZE                          equ 0001h
PORTD_RP24_LENGTH                        equ 0001h
PORTD_RP24_MASK                          equ 0080h
PORTD_SS2_POSN                           equ 0007h
PORTD_SS2_POSITION                       equ 0007h
PORTD_SS2_SIZE                           equ 0001h
PORTD_SS2_LENGTH                         equ 0001h
PORTD_SS2_MASK                           equ 0080h

// Register: PORTE
#define PORTE PORTE
PORTE                                    equ 0F84h
// bitfield definitions
PORTE_RE0_POSN                           equ 0000h
PORTE_RE0_POSITION                       equ 0000h
PORTE_RE0_SIZE                           equ 0001h
PORTE_RE0_LENGTH                         equ 0001h
PORTE_RE0_MASK                           equ 0001h
PORTE_RE1_POSN                           equ 0001h
PORTE_RE1_POSITION                       equ 0001h
PORTE_RE1_SIZE                           equ 0001h
PORTE_RE1_LENGTH                         equ 0001h
PORTE_RE1_MASK                           equ 0002h
PORTE_RE2_POSN                           equ 0002h
PORTE_RE2_POSITION                       equ 0002h
PORTE_RE2_SIZE                           equ 0001h
PORTE_RE2_LENGTH                         equ 0001h
PORTE_RE2_MASK                           equ 0004h
PORTE_REPU_POSN                          equ 0006h
PORTE_REPU_POSITION                      equ 0006h
PORTE_REPU_SIZE                          equ 0001h
PORTE_REPU_LENGTH                        equ 0001h
PORTE_REPU_MASK                          equ 0040h
PORTE_RDPU_POSN                          equ 0007h
PORTE_RDPU_POSITION                      equ 0007h
PORTE_RDPU_SIZE                          equ 0001h
PORTE_RDPU_LENGTH                        equ 0001h
PORTE_RDPU_MASK                          equ 0080h
PORTE_AN5_POSN                           equ 0000h
PORTE_AN5_POSITION                       equ 0000h
PORTE_AN5_SIZE                           equ 0001h
PORTE_AN5_LENGTH                         equ 0001h
PORTE_AN5_MASK                           equ 0001h
PORTE_AN6_POSN                           equ 0001h
PORTE_AN6_POSITION                       equ 0001h
PORTE_AN6_SIZE                           equ 0001h
PORTE_AN6_LENGTH                         equ 0001h
PORTE_AN6_MASK                           equ 0002h
PORTE_AN7_POSN                           equ 0002h
PORTE_AN7_POSITION                       equ 0002h
PORTE_AN7_SIZE                           equ 0001h
PORTE_AN7_LENGTH                         equ 0001h
PORTE_AN7_MASK                           equ 0004h
PORTE_PMPRD_POSN                         equ 0000h
PORTE_PMPRD_POSITION                     equ 0000h
PORTE_PMPRD_SIZE                         equ 0001h
PORTE_PMPRD_LENGTH                       equ 0001h
PORTE_PMPRD_MASK                         equ 0001h
PORTE_PMPWR_POSN                         equ 0001h
PORTE_PMPWR_POSITION                     equ 0001h
PORTE_PMPWR_SIZE                         equ 0001h
PORTE_PMPWR_LENGTH                       equ 0001h
PORTE_PMPWR_MASK                         equ 0002h
PORTE_PMPCS_POSN                         equ 0002h
PORTE_PMPCS_POSITION                     equ 0002h
PORTE_PMPCS_SIZE                         equ 0001h
PORTE_PMPCS_LENGTH                       equ 0001h
PORTE_PMPCS_MASK                         equ 0004h
PORTE_PD2_POSN                           equ 0000h
PORTE_PD2_POSITION                       equ 0000h
PORTE_PD2_SIZE                           equ 0001h
PORTE_PD2_LENGTH                         equ 0001h
PORTE_PD2_MASK                           equ 0001h
PORTE_PC2_POSN                           equ 0001h
PORTE_PC2_POSITION                       equ 0001h
PORTE_PC2_SIZE                           equ 0001h
PORTE_PC2_LENGTH                         equ 0001h
PORTE_PC2_MASK                           equ 0002h
PORTE_CCP10_POSN                         equ 0002h
PORTE_CCP10_POSITION                     equ 0002h
PORTE_CCP10_SIZE                         equ 0001h
PORTE_CCP10_LENGTH                       equ 0001h
PORTE_CCP10_MASK                         equ 0004h
PORTE_CCP6E_POSN                         equ 0006h
PORTE_CCP6E_POSITION                     equ 0006h
PORTE_CCP6E_SIZE                         equ 0001h
PORTE_CCP6E_LENGTH                       equ 0001h
PORTE_CCP6E_MASK                         equ 0040h
PORTE_CCP2E_POSN                         equ 0007h
PORTE_CCP2E_POSITION                     equ 0007h
PORTE_CCP2E_SIZE                         equ 0001h
PORTE_CCP2E_LENGTH                       equ 0001h
PORTE_CCP2E_MASK                         equ 0080h
PORTE_RDE_POSN                           equ 0000h
PORTE_RDE_POSITION                       equ 0000h
PORTE_RDE_SIZE                           equ 0001h
PORTE_RDE_LENGTH                         equ 0001h
PORTE_RDE_MASK                           equ 0001h
PORTE_WRE_POSN                           equ 0001h
PORTE_WRE_POSITION                       equ 0001h
PORTE_WRE_SIZE                           equ 0001h
PORTE_WRE_LENGTH                         equ 0001h
PORTE_WRE_MASK                           equ 0002h
PORTE_CS_POSN                            equ 0002h
PORTE_CS_POSITION                        equ 0002h
PORTE_CS_SIZE                            equ 0001h
PORTE_CS_LENGTH                          equ 0001h
PORTE_CS_MASK                            equ 0004h
PORTE_PB1E_POSN                          equ 0006h
PORTE_PB1E_POSITION                      equ 0006h
PORTE_PB1E_SIZE                          equ 0001h
PORTE_PB1E_LENGTH                        equ 0001h
PORTE_PB1E_MASK                          equ 0040h
PORTE_PA2E_POSN                          equ 0007h
PORTE_PA2E_POSITION                      equ 0007h
PORTE_PA2E_SIZE                          equ 0001h
PORTE_PA2E_LENGTH                        equ 0001h
PORTE_PA2E_MASK                          equ 0080h
PORTE_PB2_POSN                           equ 0002h
PORTE_PB2_POSITION                       equ 0002h
PORTE_PB2_SIZE                           equ 0001h
PORTE_PB2_LENGTH                         equ 0001h
PORTE_PB2_MASK                           equ 0004h
PORTE_RE6_POSN                           equ 0006h
PORTE_RE6_POSITION                       equ 0006h
PORTE_RE6_SIZE                           equ 0001h
PORTE_RE6_LENGTH                         equ 0001h
PORTE_RE6_MASK                           equ 0040h
PORTE_RE7_POSN                           equ 0007h
PORTE_RE7_POSITION                       equ 0007h
PORTE_RE7_SIZE                           equ 0001h
PORTE_RE7_LENGTH                         equ 0001h
PORTE_RE7_MASK                           equ 0080h

// Register: HLVDCON
#define HLVDCON HLVDCON
HLVDCON                                  equ 0F85h
// bitfield definitions
HLVDCON_HLVDL_POSN                       equ 0000h
HLVDCON_HLVDL_POSITION                   equ 0000h
HLVDCON_HLVDL_SIZE                       equ 0004h
HLVDCON_HLVDL_LENGTH                     equ 0004h
HLVDCON_HLVDL_MASK                       equ 000Fh
HLVDCON_HLVDEN_POSN                      equ 0004h
HLVDCON_HLVDEN_POSITION                  equ 0004h
HLVDCON_HLVDEN_SIZE                      equ 0001h
HLVDCON_HLVDEN_LENGTH                    equ 0001h
HLVDCON_HLVDEN_MASK                      equ 0010h
HLVDCON_IRVST_POSN                       equ 0005h
HLVDCON_IRVST_POSITION                   equ 0005h
HLVDCON_IRVST_SIZE                       equ 0001h
HLVDCON_IRVST_LENGTH                     equ 0001h
HLVDCON_IRVST_MASK                       equ 0020h
HLVDCON_BGVST_POSN                       equ 0006h
HLVDCON_BGVST_POSITION                   equ 0006h
HLVDCON_BGVST_SIZE                       equ 0001h
HLVDCON_BGVST_LENGTH                     equ 0001h
HLVDCON_BGVST_MASK                       equ 0040h
HLVDCON_VDIRMAG_POSN                     equ 0007h
HLVDCON_VDIRMAG_POSITION                 equ 0007h
HLVDCON_VDIRMAG_SIZE                     equ 0001h
HLVDCON_VDIRMAG_LENGTH                   equ 0001h
HLVDCON_VDIRMAG_MASK                     equ 0080h
HLVDCON_HLVDL0_POSN                      equ 0000h
HLVDCON_HLVDL0_POSITION                  equ 0000h
HLVDCON_HLVDL0_SIZE                      equ 0001h
HLVDCON_HLVDL0_LENGTH                    equ 0001h
HLVDCON_HLVDL0_MASK                      equ 0001h
HLVDCON_HLVDL1_POSN                      equ 0001h
HLVDCON_HLVDL1_POSITION                  equ 0001h
HLVDCON_HLVDL1_SIZE                      equ 0001h
HLVDCON_HLVDL1_LENGTH                    equ 0001h
HLVDCON_HLVDL1_MASK                      equ 0002h
HLVDCON_HLVDL2_POSN                      equ 0002h
HLVDCON_HLVDL2_POSITION                  equ 0002h
HLVDCON_HLVDL2_SIZE                      equ 0001h
HLVDCON_HLVDL2_LENGTH                    equ 0001h
HLVDCON_HLVDL2_MASK                      equ 0004h
HLVDCON_HLVDL3_POSN                      equ 0003h
HLVDCON_HLVDL3_POSITION                  equ 0003h
HLVDCON_HLVDL3_SIZE                      equ 0001h
HLVDCON_HLVDL3_LENGTH                    equ 0001h
HLVDCON_HLVDL3_MASK                      equ 0008h

// Register: DMACON2
#define DMACON2 DMACON2
DMACON2                                  equ 0F86h
// bitfield definitions
DMACON2_INTLVL_POSN                      equ 0000h
DMACON2_INTLVL_POSITION                  equ 0000h
DMACON2_INTLVL_SIZE                      equ 0004h
DMACON2_INTLVL_LENGTH                    equ 0004h
DMACON2_INTLVL_MASK                      equ 000Fh
DMACON2_DLYCYC_POSN                      equ 0004h
DMACON2_DLYCYC_POSITION                  equ 0004h
DMACON2_DLYCYC_SIZE                      equ 0004h
DMACON2_DLYCYC_LENGTH                    equ 0004h
DMACON2_DLYCYC_MASK                      equ 00F0h
DMACON2_INTLVL0_POSN                     equ 0000h
DMACON2_INTLVL0_POSITION                 equ 0000h
DMACON2_INTLVL0_SIZE                     equ 0001h
DMACON2_INTLVL0_LENGTH                   equ 0001h
DMACON2_INTLVL0_MASK                     equ 0001h
DMACON2_INTLVL1_POSN                     equ 0001h
DMACON2_INTLVL1_POSITION                 equ 0001h
DMACON2_INTLVL1_SIZE                     equ 0001h
DMACON2_INTLVL1_LENGTH                   equ 0001h
DMACON2_INTLVL1_MASK                     equ 0002h
DMACON2_INTLVL2_POSN                     equ 0002h
DMACON2_INTLVL2_POSITION                 equ 0002h
DMACON2_INTLVL2_SIZE                     equ 0001h
DMACON2_INTLVL2_LENGTH                   equ 0001h
DMACON2_INTLVL2_MASK                     equ 0004h
DMACON2_INTLVL3_POSN                     equ 0003h
DMACON2_INTLVL3_POSITION                 equ 0003h
DMACON2_INTLVL3_SIZE                     equ 0001h
DMACON2_INTLVL3_LENGTH                   equ 0001h
DMACON2_INTLVL3_MASK                     equ 0008h
DMACON2_DLYCYC0_POSN                     equ 0004h
DMACON2_DLYCYC0_POSITION                 equ 0004h
DMACON2_DLYCYC0_SIZE                     equ 0001h
DMACON2_DLYCYC0_LENGTH                   equ 0001h
DMACON2_DLYCYC0_MASK                     equ 0010h
DMACON2_DLYCYC1_POSN                     equ 0005h
DMACON2_DLYCYC1_POSITION                 equ 0005h
DMACON2_DLYCYC1_SIZE                     equ 0001h
DMACON2_DLYCYC1_LENGTH                   equ 0001h
DMACON2_DLYCYC1_MASK                     equ 0020h
DMACON2_DLYCYC2_POSN                     equ 0006h
DMACON2_DLYCYC2_POSITION                 equ 0006h
DMACON2_DLYCYC2_SIZE                     equ 0001h
DMACON2_DLYCYC2_LENGTH                   equ 0001h
DMACON2_DLYCYC2_MASK                     equ 0040h
DMACON2_DLYCYC3_POSN                     equ 0007h
DMACON2_DLYCYC3_POSITION                 equ 0007h
DMACON2_DLYCYC3_SIZE                     equ 0001h
DMACON2_DLYCYC3_LENGTH                   equ 0001h
DMACON2_DLYCYC3_MASK                     equ 0080h

